---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleDimLineSnapDist
source: html/1affa941-d61f-a554-e457-43cc819becd0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleDimLineSnapDist Property

"Dimension Line Snap Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleDimLineSnapDist { get; }
```